package oop;

public class Ex01 {
	/*
	 * OOP(Object Oriented Programming)
	 * -객체 지향 프로그래밍
	 * - 객체를 정의하고 객체 간의 상호작용으로 프로그램을 작성하는 기법
	 * 
	 * 객체(Object): 현실의 모든 데이터를 의미
	 * 상호작용(Interaction) : 객체 간의 동작 및 관계를 의미
	 * 
	 * 클래스(Class) : 객체를 프로그램 언어로 작성한 상태(=도면)
	 * 인스턴스(Instance) : 클래스를 메모리에 생성한 상태. 즉, 객체를 컴퓨터에 생성한 상태(=실체_
	 * 
	 * 작성 순서)
	 * 객체를 지정 -> 클래스를 작성-> 인스턴스 생성
	 * 
	 * class 클래스명(){
	 * 		1.필드 : 멤버변수. 객체의 속성을 정의
	 * 		2.메서드 : 멤버 함수. 객체의 기능을 정의
	 * }
	 * 
	 * new 클래스명() : 인스턴스 생성 키워드
	 * - 생성된 인스턴스는 참조변수로 가리켜놓지 않으면 재사용 불가능
	 * 
	 * 클래스명 변수명 = new 클래스명();
	 * 
	 */

}
